// Створити масив з трьох чисел. Змінити значення другого елемента масиву на 10.

// const numbre = [1, 2, 3,]
// numbre[1] = 10;
// console.log(numbre);



// Створити масив із трьох рядків. Додати до масиву ще одну рядків.

// let strings = ["яблуко, банан, груша"];
// strings.push("ананас") //дивився на mdn
// console.log(strings);


// Створити скрипт який поверне суму всіх чисел в масиві.

// let numbers = [5, 10, 20, 1, 4]
// let suma = 0;

// for (const q of numbers){
//         suma += q
// }
// console.log(suma);


// Створити масив з 5-ти чисел. Вивести на екран всі елементи масиву за допомогою циклу for.

const num = [5, 11, 22, 3, 1,]
for (let i = 0; i < num.length; i += 1){
    console.log(num[i]);
    
}